tap "classmethod/repos"
tap "ngrok/ngrok"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Freely available high-quality data compressor
brew "bzip2"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern replacement for 'ls'
brew "exa"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Library for manipulating PNG images
brew "libpng"
# Command-line fuzzy finder written in Go
brew "fzf"
# Image manipulation library
brew "jpeg", link: true
# GNU troff text-formatting system
brew "groff"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@77"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# BSD-style licensed readline alternative
brew "libedit"
# Conversion library
brew "libiconv"
# Postgres C API library
brew "libpq"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# GNOME XML library
brew "libxml2"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Powerful multi-lingual file viewer/grep
brew "lv"
# Text-based web browser
brew "lynx"
# Replacement for the old crypt package and crypt(1) command
brew "mcrypt"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Simplistic interactive filtering tool
brew "peco"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Implementation of Telnet and SSH
brew "putty"
# Generate C-based recognizers from regular expressions
brew "re2c"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Process Control System
brew "supervisor"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Pager/text based browser
brew "w3m"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
brew "classmethod/repos/aurl"
# Browser to organise apps
cask "biscuit"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
vscode "1yib.rust-bundle"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "awesomektvn.toggle-semicolon"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bmewburn.vscode-intelephense-client"
vscode "christian-kohler.npm-intellisense"
vscode "cocopon.iceberg-theme"
vscode "coenraads.bracket-pair-colorizer"
vscode "compulim.vscode-clock"
vscode "dariofuzinato.vue-peek"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "eg2.vscode-npm-script"
vscode "eryouhao.brackets-light-pro"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "gencer.html-slim-scss-css-class-completion"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gogocrow.jsx-beautify"
vscode "grapecity.gc-excelviewer"
vscode "gulajavaministudio.mayukaithemevsc"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "imperez.smarty"
vscode "irongeek.vscode-env"
vscode "jakewilson.vscode-cdnjs"
vscode "jakob101.relativepath"
vscode "janisdd.vscode-edit-csv"
vscode "jinxdash.prettier-rust"
vscode "k--kato.vscode-backlog-wiki-preview"
vscode "kamikillerto.vscode-colorize"
vscode "leizongmin.node-module-intellisense"
vscode "luqimin.velocity"
vscode "mblode.twig-language-2"
vscode "mechatroner.rainbow-csv"
vscode "mohamedbenhida.laravel-intellisense"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-explorer"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "pizzacat83.codic"
vscode "prisma.prisma"
vscode "rust-lang.rust-analyzer"
vscode "sainnhe.gruvbox-material"
vscode "samuelcolvin.jinjahtml"
vscode "serayuzgur.crates"
vscode "shan.code-settings-sync"
vscode "shardulm94.trailing-spaces"
vscode "shinworks.jsdoc-view"
vscode "sodatea.velocity"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "syler.sass-indented"
vscode "tauri-apps.tauri-vscode"
vscode "teabyii.ayu"
vscode "techtheawesome.rust-yew"
vscode "tomoki1207.pdf"
vscode "trongthanh.theme-boxythemekit"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vsls-contrib.codetour"
vscode "vue.volar"
vscode "vue.vscode-typescript-vue-plugin"
vscode "whatwedo.twig"
vscode "wholroyd.jinja"
vscode "wraith13.zoombar-vscode"
vscode "yoyo930021.vuter"
vscode "yuichinukiyama.vscode-preview-server"
vscode "yzhang.markdown-all-in-one"
